{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [5, 5, 1, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [5, 5, 32, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_2/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [5, 5, 64, 96], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [96], "name": "conv2d_3/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [864, 256], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [256], "name": "dense_1/bias"}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "shape": [256, 3], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [3], "name": "dense_2/bias"}]}], "modelTopology": {"backend": "tensorflow", "model_config": {"config": [{"config": {"dtype": "float32", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "activation": "linear", "kernel_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "use_bias": true, "padding": "same", "bias_regularizer": null, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "filters": 96}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "dense_1", "units": 256, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.6, "noise_shape": null, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "dense_2", "units": 3, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_5"}, "class_name": "Activation"}], "class_name": "Sequential"}, "training_config": {"sample_weight_mode": null, "loss": "categorical_crossentropy", "optimizer_config": {"config": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "epsilon": 1e-07, "decay": 0.0}, "class_name": "RMSprop"}, "loss_weights": null, "metrics": ["accuracy"]}, "keras_version": "2.1.5"}}